read_verilog examples/patterns/access_control/locked_register/locked_register.v
hierarchy -top locked_register_adff_mux

# read_verilog examples/cwe1234/variant1.v
# hierarchy -top locked_register_example

proc
clean


write_rtlil locked_register_example.rtlil