read_verilog examples/patterns/access_control/locked_register/adff_mux.v
hierarchy -top locked_register_adff_mux

# read_verilog examples/cwe1234/variant1.v
# hierarchy -top locked_register_example

proc
clean
opt
clean
show -format dot -prefix design_graph